
<!DOCTYPE html>
   <meta charset="UTF-8">
   <h> Операторы в php </h>

   <br>

<?php

/* 1.Арифметические операторы
 * 2.Операторы присваивания
 * 3.Операторы сравнения
 * 4.Операторы инкримента и дикримента
 * 5.Логические операторы
 * 6.Строковые операторы
 * 7.Операторы массивов
 * - Приоритет операторов
 *
 * Для самостоятельного ознакомления
 * 8.Побитовые операторы
 * 9.Операторы управления ошибками
 * 10.Оператор исполнения
 * 11.Оператор проверки типа
 */

//1.Арифметические операторы(+,-,/,*,%,**)
//модус % остаток от деления 13%4равно1
//2**4 два в степени 4
//  echo 13%4;
//2.Операторы присваивания(=,+=,-=,/=,*=,%=)
   $i = 16;
   $i %=10; //$i = $i +10;
   // $i =10;//можно перезаписывать результат 10
   //echo $i;
//3.Операторы сравнения(<,>,<=,>=,==,===,!=,<>,!==)
  if ($i != '6')
  {
     // echo'true';
  }
  else
  {
   //   echo 'false';
  }

//4.Операторы инкримента и дикримента($i++,++$i,$i--,--$i)
  //echo ++$i.'<br>';
  //echo $i++.'<br>';
   //echo --$i.'<br>';
    // echo $i--.'<br>';
    // echo $i;
//5.Логические операторы(!,and,or,xor,&&,||)
 $a = true;
 $b = true;
 $c = false;

 if($a and $b and $c)
  {
 //   echo 'true';
  }
    else
  {
 //   echo 'false';
  }

//6.Строковые операторы(.,.=)
// $string = 'Привет';
 //$string .='Влад';
 //echo $string;
 // $string ='<p>'.$i.'</p>';
//  $string .='Влад!';
 // echo $string;

//7.Операторы массивов(+,==,!=,<>,===,!==)

 // $array_1 = array('Значение 1','Значение 2');
 // $array_2 = array('Значение 3','Значение 4');
 //  echo '<pre>';
 //  print_r($array_1 + $array_2);
   //echo '</pre>';

 $array_1 = array(
        'id' => 'Значение 1',
        'title'=> 'Значение 2',
          );
 $array_2 = array(
        'id' => 'Значение 1',
        'title'=> 'Значение 2',
          );

 echo '<pre>';

 if($array_1 != $array_2)
 {
     echo '1';
 }
 else
 {
     echo'0';
 }
 echo '</pre>';

 //Приоритет операторов

 echo 2 + 2 + 5;
 $i = ($string = $i);

 //Ассоциативность левая ..правая ..и отсутствие ассоциативности
 // Приоритет